In [1]:
library(xfun, warn.conflicts = FALSE)
pkgs <- c("collapse", "tsbox", "timetk", "tidyverse", "plm", "tsibble")
pkg_attach2(pkgs, message = FALSE)

In [2]:
head(wlddev)

  country     iso3c date       year decade region     income     OECD  PCGDP
1 Afghanistan AFG   1961-01-01 1960 1960   South Asia Low income FALSE NA
2 Afghanistan AFG   1962-01-01 1961 1960   South Asia Low income FALSE NA
3 Afghanistan AFG   1963-01-01 1962 1960   South Asia Low income FALSE NA
4 Afghanistan AFG   1964-01-01 1963 1960   South Asia Low income FALSE NA
5 Afghanistan AFG   1965-01-01 1964 1960   South Asia Low income FALSE NA
6 Afghanistan AFG   1966-01-01 1965 1960   South Asia Low income FALSE NA
  LIFEEX GINI ODA
1 32.292 NA   114440000
2 32.742 NA   233350000
3 33.185 NA   114880000
4 33.624 NA   236450000
5 34.060 NA   302480000
6 34.495 NA   370250000

In [6]:
q10_quarterly <- m4_quarterly %>% filter(id == "Q10")
head(q10_quarterly)

  id  date       value
1 Q10 2000-01-01 2329.0
2 Q10 2000-04-01 2349.9
3 Q10 2000-07-01 2332.9
4 Q10 2000-10-01 2381.5
5 Q10 2001-01-01 2382.6
6 Q10 2001-04-01 2405.0